**Concat, Melt and others**

In [5]:
import pandas as pd

In [7]:
df_1 = pd.DataFrame({
   'Name': ['Rohit', 'Rahul', 'Rishi', 'Ryan', 'Arjun'],
   'Company':['TCS','CTS','WIPRO','GOOGLE','BENZ'],
   'Salary':[44000,60000,53000,25000,46000]},
   index=[11,12,13,14,15])

print("The first dataframe is : \n",df_1, "\n\n")

df_2 = pd.DataFrame({
   'Name': ['Lokesh', 'Anl', 'Anil', 'Nalini', 'Rashmi','Rashmi'],
   'Company':['HCL','TCS','WIPRO','GOOGLE','CTS','WIPRO'],
   'Salary':[45000,40000,36000,57000,55000,55000]},
   index=[11,12,13,14,15,16])

print("The second dataframe is : \n",df_2)

The first dataframe is :
      Name Company  Salary
11  Rohit     TCS   44000
12  Rahul     CTS   60000
13  Rishi   WIPRO   53000
14   Ryan  GOOGLE   25000
15  Arjun    BENZ   46000


The second dataframe is :
       Name Company  Salary
11  Lokesh     HCL   45000
12     Anl     TCS   40000
13    Anil   WIPRO   36000
14  Nalini  GOOGLE   57000
15  Rashmi     CTS   55000
16  Rashmi   WIPRO   55000

In [ ]:
df_1

In [ ]:
df_2

In [9]:
pd.concat([df_1,df_2])

      Name Company  Salary
11   Rohit     TCS   44000
12   Rahul     CTS   60000
13   Rishi   WIPRO   53000
14    Ryan  GOOGLE   25000
15   Arjun    BENZ   46000
11  Lokesh     HCL   45000
12     Anl     TCS   40000
13    Anil   WIPRO   36000
14  Nalini  GOOGLE   57000
15  Rashmi     CTS   55000
16  Rashmi   WIPRO   55000

In [11]:
pd.concat([df_1,df_2], axis=0)

      Name Company  Salary
11   Rohit     TCS   44000
12   Rahul     CTS   60000
13   Rishi   WIPRO   53000
14    Ryan  GOOGLE   25000
15   Arjun    BENZ   46000
11  Lokesh     HCL   45000
12     Anl     TCS   40000
13    Anil   WIPRO   36000
14  Nalini  GOOGLE   57000
15  Rashmi     CTS   55000
16  Rashmi   WIPRO   55000

In [13]:
pd.concat([df_1,df_2], axis=1)

     Name Company   Salary    Name Company  Salary
11  Rohit     TCS  44000.0  Lokesh     HCL   45000
12  Rahul     CTS  60000.0     Anl     TCS   40000
13  Rishi   WIPRO  53000.0    Anil   WIPRO   36000
14   Ryan  GOOGLE  25000.0  Nalini  GOOGLE   57000
15  Arjun    BENZ  46000.0  Rashmi     CTS   55000
16    NaN     NaN      NaN  Rashmi   WIPRO   55000

In [15]:
pd.concat([df_1,df_2], axis=0, ignore_index=True) #creates new index ignoring existing index

      Name Company  Salary
0    Rohit     TCS   44000
1    Rahul     CTS   60000
2    Rishi   WIPRO   53000
3     Ryan  GOOGLE   25000
4    Arjun    BENZ   46000
5   Lokesh     HCL   45000
6      Anl     TCS   40000
7     Anil   WIPRO   36000
8   Nalini  GOOGLE   57000
9   Rashmi     CTS   55000
10  Rashmi   WIPRO   55000

In [17]:
df_3=pd.concat([df_1,df_2],keys=['India','US'])
df_3

            Name Company  Salary
India 11   Rohit     TCS   44000
      12   Rahul     CTS   60000
      13   Rishi   WIPRO   53000
      14    Ryan  GOOGLE   25000
      15   Arjun    BENZ   46000
US    11  Lokesh     HCL   45000
      12     Anl     TCS   40000
      13    Anil   WIPRO   36000
      14  Nalini  GOOGLE   57000
      15  Rashmi     CTS   55000
      16  Rashmi   WIPRO   55000

In [19]:
df_3.loc['India']

     Name Company  Salary
11  Rohit     TCS   44000
12  Rahul     CTS   60000
13  Rishi   WIPRO   53000
14   Ryan  GOOGLE   25000
15  Arjun    BENZ   46000

In [21]:
df_3.loc['India',11].Salary

44000

In [23]:
df_a=pd.concat([df_1,df_2],axis=0)
df_a

      Name Company  Salary
11   Rohit     TCS   44000
12   Rahul     CTS   60000
13   Rishi   WIPRO   53000
14    Ryan  GOOGLE   25000
15   Arjun    BENZ   46000
11  Lokesh     HCL   45000
12     Anl     TCS   40000
13    Anil   WIPRO   36000
14  Nalini  GOOGLE   57000
15  Rashmi     CTS   55000
16  Rashmi   WIPRO   55000

In [25]:
df_a=pd.concat([df_1,df_2],axis=1)
df_a

     Name Company   Salary    Name Company  Salary
11  Rohit     TCS  44000.0  Lokesh     HCL   45000
12  Rahul     CTS  60000.0     Anl     TCS   40000
13  Rishi   WIPRO  53000.0    Anil   WIPRO   36000
14   Ryan  GOOGLE  25000.0  Nalini  GOOGLE   57000
15  Arjun    BENZ  46000.0  Rashmi     CTS   55000
16    NaN     NaN      NaN  Rashmi   WIPRO   55000

**Merge**

In [27]:
my_df1=pd.DataFrame({
 'Product_ID':[101,102,103,104,105,106],
 'Food_Product':['Cakes','Biscuits','Fruit','Beverages','Cakes','Beverages'],
 'Brand':['Baskin Robbins','Blue Riband','Peach','Horlicks','Mars Muffin','Mirinda'], 
})
print("The first dataframe is : \n",my_df1,"\n\n")

my_df2=pd.DataFrame({
 'Product_ID':[104,102,101,103,107,108],
 'Food_Product':['Beverages', 'Biscuits', 'Cakes', 'Fruit', 'Breakfast foods', 'Chips'],
  'Brand':['Coca-Cola', 'Oreo', 'Dunkin Donuts', 'Banana', 'Cream of Wheat', 'Cheetos']  
})
print("The second dataframe is : \n",my_df2)

The first dataframe is :
    Product_ID Food_Product           Brand
0         101        Cakes  Baskin Robbins
1         102     Biscuits     Blue Riband
2         103        Fruit           Peach
3         104    Beverages        Horlicks
4         105        Cakes     Mars Muffin
5         106    Beverages         Mirinda


The second dataframe is :
    Product_ID     Food_Product           Brand
0         104        Beverages       Coca-Cola
1         102         Biscuits            Oreo
2         101            Cakes   Dunkin Donuts
3         103            Fruit          Banana
4         107  Breakfast foods  Cream of Wheat
5         108            Chips         Cheetos

In [29]:
pd.merge(my_df1,my_df2,on='Product_ID')

   Product_ID Food_Product_x         Brand_x Food_Product_y        Brand_y
0         101          Cakes  Baskin Robbins          Cakes  Dunkin Donuts
1         102       Biscuits     Blue Riband       Biscuits           Oreo
2         103          Fruit           Peach          Fruit         Banana
3         104      Beverages        Horlicks      Beverages      Coca-Cola

In [33]:
pd.merge(my_df1,my_df2,on='Product_ID',how='right')

   Product_ID Food_Product_x         Brand_x   Food_Product_y         Brand_y
0         104      Beverages        Horlicks        Beverages       Coca-Cola
1         102       Biscuits     Blue Riband         Biscuits            Oreo
2         101          Cakes  Baskin Robbins            Cakes   Dunkin Donuts
3         103          Fruit           Peach            Fruit          Banana
4         107            NaN             NaN  Breakfast foods  Cream of Wheat
5         108            NaN             NaN            Chips         Cheetos

In [35]:
pd.merge(my_df1,my_df2,on='Product_ID',how='left')

   Product_ID Food_Product_x         Brand_x Food_Product_y        Brand_y
0         101          Cakes  Baskin Robbins          Cakes  Dunkin Donuts
1         102       Biscuits     Blue Riband       Biscuits           Oreo
2         103          Fruit           Peach          Fruit         Banana
3         104      Beverages        Horlicks      Beverages      Coca-Cola
4         105          Cakes     Mars Muffin            NaN            NaN
5         106      Beverages         Mirinda            NaN            NaN

In [31]:
pd.merge(my_df1,my_df2,on='Product_ID',how='inner')

   Product_ID Food_Product_x         Brand_x Food_Product_y        Brand_y
0         101          Cakes  Baskin Robbins          Cakes  Dunkin Donuts
1         102       Biscuits     Blue Riband       Biscuits           Oreo
2         103          Fruit           Peach          Fruit         Banana
3         104      Beverages        Horlicks      Beverages      Coca-Cola

In [37]:
pd.merge(my_df1,my_df2,on='Product_ID',how='outer')

   Product_ID Food_Product_x         Brand_x   Food_Product_y         Brand_y
0         101          Cakes  Baskin Robbins            Cakes   Dunkin Donuts
1         102       Biscuits     Blue Riband         Biscuits            Oreo
2         103          Fruit           Peach            Fruit          Banana
3         104      Beverages        Horlicks        Beverages       Coca-Cola
4         105          Cakes     Mars Muffin              NaN             NaN
5         106      Beverages         Mirinda              NaN             NaN
6         107            NaN             NaN  Breakfast foods  Cream of Wheat
7         108            NaN             NaN            Chips         Cheetos

In [39]:
df_1

     Name Company  Salary
11  Rohit     TCS   44000
12  Rahul     CTS   60000
13  Rishi   WIPRO   53000
14   Ryan  GOOGLE   25000
15  Arjun    BENZ   46000

In [41]:
df_2

      Name Company  Salary
11  Lokesh     HCL   45000
12     Anl     TCS   40000
13    Anil   WIPRO   36000
14  Nalini  GOOGLE   57000
15  Rashmi     CTS   55000
16  Rashmi   WIPRO   55000

**Reshape**

**Stack, Unstack, Melt**

In [ ]:
header=pd.MultiIndex.from_product([['2 Months','4 Months'],['Maths','English']])
header

In [ ]:
d=([[12,45,67,56],[78,89,45,67],[45,67,89,90],[67,44,56,55]])
d

In [ ]:
df=pd.DataFrame(d, index=['Ram','Sham','John','Tom'])

In [ ]:
df

In [ ]:
df=pd.DataFrame(d,index=['Ram','Sham','John','Tom'],columns=header)
df

In [ ]:
header1=pd.MultiIndex.from_product([['January','February'],['Week1','Week2','Week3','Week4']])
header1

In [ ]:
data=[[20,30,40,50,60,70,80,90],[22,33,44,33,44,55,66,77],[32,43,55,64,54,65,76,87],[90,34,65,89,76,55,44,44]]
data

In [ ]:
df=pd.DataFrame(data,index=('Ram','Harish','Goyal','Rani'),columns=header1)

In [ ]:
df

In [ ]:
header=pd.MultiIndex.from_product([['3 Months','6 Months'],['Biology','Physics','Chemistry']])
header

In [ ]:
data=[[20,30,40,50,60,70],[22,33,44,55,66,77],[32,43,54,65,76,87],[90,89,76,55,44,44]]
data

In [ ]:
df=pd.DataFrame(data,index=('Ram','Harish','Goyal','Rani'),columns=header)

In [ ]:
df

In [ ]:
df.stack(level=0)

In [ ]:
df.stack(level=1)

In [ ]:
stacked=df.stack(level=0)
stacked

In [ ]:
stacked=df.stack(level=1)
stacked

In [ ]:
stacked

**Unstack**

In [ ]:
stacked

In [ ]:
unstacked=stacked.unstack()

In [ ]:
unstacked

**Melt**

In [ ]:
data = {
    "location":['Bangalore', 'Chennai'],
    "Temperature" : ["Predict", "Actual"],
    "Jan-2019":[30, 32],
    "Feb-2019":[45, 43],
    "Mar-2019":[24, 22]
}
df = pd.DataFrame(data, columns=['location', 'Temperature','Jan-2019', 'Feb-2019', 'Mar-2019'])
print(df)

In [ ]:
pd.melt(df,id_vars=["location","Temperature","Jan-2019"])

In [ ]:
pd.melt(df,id_vars=["location","Temperature","Jan-2019"])

In [ ]:
df2=pd.melt(df)
df2

In [ ]:
pd.melt(df,id_vars=["location","Temperature"],var_name="Date",value_name="Value")

In [ ]:
data = {
    "location":['Bangalore', 'Chennai'],
    "Temperature" : ["Predict", "Actual"],
    "Jan-2019":[30, 32],
    "Feb-2019":[45, 43],
    "Mar-2019":[24, 22]
}
df = pd.DataFrame(data, columns=['location', 'Temperature','Jan-2019', 'Feb-2019', 'Mar-2019'])
print(df)

In [ ]:
df2=pd.melt(df,id_vars=["location","Temperature"],var_name="Date", value_name='ABC')
df2

In [ ]:
df2=pd.melt(df,id_vars=["location","Jan-2019"],var_name="XYZ", value_name='ABC')
df2

**pivot**

In [ ]:
#Create a DataFrame
d = {
    'Name':['Jony','Anil','Sunil','Jony','Anil','Rocky',
            'Jony','Anil','Sunil','Jony','Anil','Rocky'],
    'Exam_Months':['3_Months','3_Months','3_Months','3_Months','3_Months','3_Months',
            '6_Months','6_Months','6_Months','6_Months','6_Months','6_Months'],
     
    'Subject':['Python','Python','SQL','SQL','ML','ML',
               'Python','Python','SQL','SQL','ML','ML'],
   'Score':[62,47,55,74,31,77,85,63,42,67,89,81]}
 
df = pd.DataFrame(d,columns=['Name','Exam_Months','Subject','Score'])
df

In [ ]:
df

In [ ]:
pd.pivot(df,index=['Name','Exam_Months'], columns=['Subject'])

In [ ]:
pd.pivot_table(df,index=['Name','Exam_Months','Subject'],margins=True)

In [ ]:
# pivot table using aggregate function sum
 
pd.pivot_table(df, index=['Name','Subject','Exam_Months'], aggfunc='max',margins=True,margins_name='Max Marks')

In [ ]:
d={"Name":['Ram','Sham','Joy','Roy','Geeta','Site',
           'Ram','Sham','Joy','Roy','Geeta','Site'],
    "Sem":['Sem1','Sem1','Sem1','Sem1','Sem1','Sem1',
           'Sem2','Sem2','Sem2','Sem2','Sem2','Sem2'],
    "Course":["Eng","Kannada","Hindi","Eng","Kannada","Hindi",
               "Eng","Kannada","Hindi","Eng","Kannada","Hindi"],
   "Marks":[44,55,66,55,44,33,22,11,44,55,66,77] 
}

In [ ]:
d

In [ ]:
df=pd.DataFrame(d,columns=["Name","Sem","Course","Marks"])
df

In [ ]:
df2=pd.pivot_table(df,index=["Name","Sem","Course"])
df2

**Crosstable**
#frequency

In [ ]:
df=pd.read_csv("Humidity1.csv")
df

In [ ]:
pd.crosstab(df.city,df.date)

In [ ]:
pd.crosstab(df.city,df.date,values=df.temperature,aggfunc='mean')

**duplicates**

In [ ]:
#Create a DataFrame
d = {
    'Name':['Jony','Anil','Sunil','Jony','Anil','Rocky',
            'Jony','Anil','Sunil','Jony','Anil','Rocky'],
    'Exam_Months':['3_Months','3_Months','6_Months','3_Months','3_Months','3_Months',
            '3_Months','6_Months','6_Months','6_Months','6_Months','6_Months'],
     
    'Subject':['Python','Python','SQL','SQL','ML','ML',
               'Python','Python','SQL','SQL','ML','ML'],
   'Score':[62,47,42,74,31,77,62,63,42,67,89,81]}
 
df = pd.DataFrame(d,columns=['Name','Exam_Months','Subject','Score'])
df

In [ ]:
df[df.duplicated()]

In [ ]:
df.drop_duplicates()

In [ ]:
df

In [ ]:
df.drop_duplicates('Name',keep='last')

In [ ]:
df

In [ ]:
df=pd.read_csv('Humidity1.csv')
df

In [ ]:
df.groupby(['city']).max()

In [ ]:
df1= df.groupby(['city'])
df1
for city,city_df in df1:
    print(city)
    print(city_df)

In [ ]:
df1.get_group("mumbai")

In [ ]:
df1.max()

In [ ]:
df1.describe()

In [ ]:
df1.plot()

**map**

In [ ]:
Season = {'new york':'winter', 'mumbai':'summer'}

In [ ]:
df = pd.read_csv("Humidity1.csv")
df

In [ ]:
df['Season']=df['city'].map(Season)

In [ ]:
df

**Replacing**

In [ ]:
df['city'].replace('new york','NY')

**renaming**

In [ ]:
df.rename(columns={'temperature':'temp'},inplace=True)

In [ ]:
df

In [ ]:
import pandas as pd
df_cust=pd.read_excel('Ecommerce_data.xlsx', sheet_name='Cust_data')
df_cust

In [ ]:
df_order=pd.read_excel('Ecommerce_data.xlsx', sheet_name='Ord_data')
df_order

In [ ]:
df_cust.set_index('Cust_ID').join(df_order.set_index('Cust_ID'), on='Cust_ID', how='inner')